app/views/videos/show.html.erb

<ul>
  <% @video.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."video_id" = $1  [["video_id", 31]]