app/controllers/comments_controller.rb

  def new
    @video = Video.find(params[:video_id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", nil]]

  def create

    @video = Video.find(params[:video_id])
    @comment = Comment.create!(comment_params.merge(video: @video))
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("text_body", "author", "date_created", "video_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["text_body", "Test comment"], ["author", "Anand"], ["date_created", "Aug 4th 2015"], ["video_id", 20], ["created_at", "2015-08-05 02:08:23.078783"], ["updated_at", "2015-08-05 02:08:23.078783"]]

  def update

    @comment = Comment.find(params[:id])
  @video = Video.find(params[:video_id])
  @comment.update(song_params.merge(video: @video))
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "comments" SET "text_body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["text_body", "Video 1 looks good, yay! & yay!"], ["updated_at", "2015-08-05 02:06:02.344185"], ["id", 6]]