app/controllers/videos_controller.rb

  def index
    # @videos = Video.all.order(:likes).reverse
    # @videos = Video.all
    if current_user
      @videos = current_user.videos

      if params[:search]
          @videos = Video.search(params[:search]).order("created_at DESC").paginate(page: params[:page], per_page: 2)
        else
          @videos = Video.all.order('created_at DESC').paginate(page: params[:page], per_page: 2)
        end
    else
      @videos =Video.all.paginate(page: params[:page], per_page: 2)
---
SELECT "videos".* FROM "videos" WHERE (LOWER(subject) LIKE '%python%')  ORDER BY created_at DESC
SELECT COUNT(*) FROM "videos"
SELECT "videos".* FROM "videos" WHERE "videos"."user_id" = $1  [["user_id", 1]]

    def show
    @video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 3]]

  def edit
    @video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 24]]

  def update
    @video = Video.find(params[:id])

    @video.update(video_params)
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 30]]
UPDATE "videos" SET "subject" = $1, "link_url" = $2, "updated_at" = $3 WHERE "videos"."id" = $4  [["subject", "Chaiya chaiya"], ["link_url", "https://www.youtube.com/embed/yHA9lxVhNdo"], ["updated_at", "2015-08-04 16:00:07.453420"], ["id", 32]]

  def destroy
    @video = Video.find(params[:id])
    @video.destroy
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 24]]
DELETE FROM "videos" WHERE "videos"."id" = $1  [["id", 24]]

def upvote
  @video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 5]]