app/controllers/videos_controller.rb

INSERT INTO "videos" ("subject", "author", "date_created", "likes", "link_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["subject", "hi"], ["author", "hi"], ["date_created", "hi"], ["likes", 0], ["link_url", "hi"], ["created_at", "2015-08-04 15:37:59.659386"], ["updated_at", "2015-08-04 15:37:59.659386"]]
---
    def create

    @video = Video.create!(video_params)